Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиМерча.Записывать = Истина;
	
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура", "Количество");
	
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
		Движение = Движения.ОстаткиМерча.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	Движения.Записать();
	//проверка на наличие товара
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиМерчаОстатки.Номенклатура КАК Номенклатура,
	               |	ОстаткиМерчаОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ОстаткиМерча.Остатки(&МоментВремени, ) КАК ОстаткиМерчаОстатки
	               |ГДЕ
	               |	ОстаткиМерчаОстатки.КоличествоОстаток < 0";
	
	Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;

	СуммаЗолото = 0;
	СуммаСеребро = 0;
	Для Каждого Строка Из Товары Цикл
		Если Строка.ЕдиницаИзмерений = Перечисления.ТипВознаграждения.Золото Тогда
			СуммаЗолото = СуммаЗолото + (Строка.Цена * Строка.Количество);
		Иначе 
			СуммаСеребро = СуммаСеребро + (Строка.Цена * Строка.Количество); 
		КонецЕсли;
	КонецЦикла;
	
	//проверка на наличие монет 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.КоличествоЗолото КАК КоличествоЗолото,
	               |	ФизическиеЛица.КоличествоСеребро КАК КоличествоСеребро
	               |ИЗ
	               |	Документ.РеализацияМерча КАК РеализацияМерча
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ПО РеализацияМерча.ФизическоеЛицо = ФизическиеЛица.Ссылка
	               |ГДЕ
	               |	РеализацияМерча.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗолотоЛицо = Выборка.КоличествоЗолото;
		СереброЛицо = Выборка.КоличествоСеребро;
	КонецЦикла;
	
	Если СуммаЗолото > ЗолотоЛицо ИЛИ СуммаСеребро > СереброЛицо Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//списание монет
	
	СсылкаСправочник = Справочники.ФизическиеЛица.НайтиПоНаименованию(ФизическоеЛицо);
	СправочникОбъект = СсылкаСправочник.ПолучитьОбъект();
	СправочникОбъект.КоличествоЗолото = ЗолотоЛицо - СуммаЗолото;
	СправочникОбъект.КоличествоСеребро = СереброЛицо - СуммаСеребро;
	СправочникОбъект.Записать();
	КонецПроцедуры
	
