
&НаКлиенте
Процедура ПодборМодификатора(Команда)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.БонусыИШтрафы.ФормаВыбора", ПараметрыОткрытия, Элементы.МодификаторыСтоимости);
КонецПроцедуры

&НаКлиенте
Процедура МодификаторыСтоимостиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтруктураПоиска = Новый Структура("Модификатор", ВыбранноеЗначение.Модификатор);
		Строки = Объект.МодификаторыСтоимости.НайтиСтроки(СтруктураПоиска);
		Если Строки.Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект.МодификаторыСтоимости.Добавить(), ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
