
#Область ПрограммныйИнтерфейс

// Текст ответа пользователю телеграм, который написал боту первый раз
// 
// Возвращаемое значение:
//  Строка - Текст ответа
Функция ОтветНеизвестномуПользователю() Экспорт
	Возврат "Вы написали боту компании %CompanyName% по работе с сотрудниками.
		|С помощью него вы сможете:
		|	- Пройти корпоративные квесты и заработать награды;
		|	- Поблагодарить своих коллег за хорошую работу и узнать кого поблагодарили;
		|	- Потрать заработанные награды на ценные призы.
		|
		|Для начала давайте познакомимся. Введите свое ФИО (как в паспорте).";
КонецФункции	

// Ответ на неудачную проверку ФИО
// 
// Возвращаемое значение:
//  Строка - Текст ответа
Функция ОшибкаПоискаФизическогоЛица() Экспорт
	Возврат "Указанное ФИО не найдено среди сотрудников компании. К сожалению взаимодействие с ботом невозможно.";	
КонецФункции

// Ответ корректное ФИО для связи с учетной записью
// 
// Возвращаемое значение:
//  Строка - Текст ответа
Функция УспешнаяСвязьУчетнойЗаписиИФизЛица() Экспорт
	Возврат "Приятно познакомиться! Теперь вы можете использовать возможности бота.
		|Для получения подробной информации воспользуйтесь командой /help или командами в меню бота.";	
КонецФункции

// Ответ на неизвестную команду
// 
// Возвращаемое значение:
//  Строка - Текст ответа
Функция ОтветНаНеизвестнуюКоманду() Экспорт
	Возврат "Я не знаю такой команды.
		|Для получения подробной информации воспользуйтесь командой /help или командами в меню бота.";	
КонецФункции

#КонецОбласти