
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСообщениеЧата(ТекстСообщения, ФизическоеЛицо, УчетнаяЗапись, Ответ) Экспорт

	Если ТекстСообщения = "Баланс" Тогда
		// Алгоритм получения баланса для физлица ФизическоеЛицо
		ТекстОтвета = "Демо вывод баланса";
		Ответ = Телеграм.НовыйОтветНаСообщение(УчетнаяЗапись, ТекстОтвета);
	КонецЕсли;
	
	Если ТекстСообщения = "Текущие задания" Тогда		
		ДополнительныеПараметры = Телеграм.НовыеДополнительныеПараметрыСообщенияФизЛицу();
		ДополнительныеПараметры.ОтобразитьКаталог = Перечисления.ВидыКаталогов.Задачи;
		Ответ = Телеграм.НовыйОтветНаСообщение(УчетнаяЗапись, "", ДополнительныеПараметры);
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьКнопкиМеню(ПозицияМеню, Кнопки) Экспорт
		
	Если ПозицияМеню = Перечисления.ПозицииМеню.Старт Тогда
		Кнопки.Добавить("Баланс");
		Кнопки.Добавить("Каталог бонусов");
		Кнопки.Добавить("Текущие задания");
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриПолученииЭлементовКаталога(ЭлементыКаталога, Каталог, СтрокаПоиска) Экспорт
	
	// Для теста используем справочник Страны мира
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтраныМира.Ссылка
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира";
	
	ЭлементыКаталога = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецПроцедуры

Процедура ПриПолученииСсылкиНаОбъект(Каталог, Идентификатор, Ссылка) Экспорт
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(Идентификатор);
	
	Ссылка = Справочники.СтраныМира.ПолучитьСсылку(УникальныйИдентификатор);		
		
КонецПроцедуры

Процедура ПриПолученииОписанияОбъекта(Ссылка, ОписаниеОбъекта) Экспорт
	
	ОписаниеОбъекта.ПодробноеОписание = "" + Ссылка + 
		Символы.ПС + Ссылка.НаименованиеПолное +
		Символы.ПС + Ссылка.МеждународноеНаименование;
		
	Команда = Новый Структура;
	Команда.Вставить("Наименование", "В красный");
	Команда.Вставить("id", "red");
	
	ОписаниеОбъекта.Команды.Добавить(Команда); 	
	
КонецПроцедуры

Процедура ПриОбработкеКомандыОбъекта(Ссылка, ИдентификаторКоманды, ТекстСообщения, Команды) Экспорт
	
	ТекстСообщения = "Страна перекрашена";
	
	Команда = Новый Структура;
	Если ИдентификаторКоманды = "red" Тогда
		Команда.Вставить("Наименование", "В синий");
		Команда.Вставить("id", "blue");
	Иначе
		Команда.Вставить("Наименование", "В красный");
		Команда.Вставить("id", "red");		
	КонецЕсли;
			
	Команды.Добавить(Команда);
	
КонецПроцедуры

#КонецОбласти