
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСообщениеЧата(ТекстСообщения, ТекущийПользователь, Ответ) Экспорт

	Если ТекстСообщения = "Баланс" Тогда
		// Алгоритм получения баланса для физлица ТекущийПользователь.ФизическоеЛицо
		ТекстОтвета = "Демо вывод баланса";
		Ответ = Телеграм.НовыйОтветНаСообщение(ТекущийПользователь.УчетнаяЗапись, ТекстОтвета);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьКнопкиМеню(ПозицияМеню, Кнопки) Экспорт
		
	Если ПозицияМеню = Перечисления.ПозицииМеню.Старт Тогда
		Кнопки.Добавить("Баланс");
		Кнопки.Добавить("Каталог бонусов");
		Кнопки.Добавить("Текущие задания");
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти