
#Область ПрограммныйИнтерфейс

Процедура УстановитьПозициюМеню(УчетнаяЗапись, ПозицияМеню) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.ПозицияМеню = ПозицияМеню;
	Запись.Записать();
	
КонецПроцедуры

Функция ТекущаяПозицияМеню(УчетнаяЗапись) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТекущиеПозицииМенюУчетныхЗаписей.ПозицияМеню
		|ИЗ
		|	РегистрСведений.ТекущиеПозицииМенюУчетныхЗаписей КАК ТекущиеПозицииМенюУчетныхЗаписей
		|ГДЕ
		|	ТекущиеПозицииМенюУчетныхЗаписей.УчетнаяЗапись = &УчетнаяЗапись";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПозицияМеню;
	КонецЕсли;
	
	Возврат Перечисления.ПозицииМеню.Старт;
	
КонецФункции

#КонецОбласти