#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Создает новый документ "Спасибо"
//
// Параметры:
//  Кто - СправочникСсылка.ФизическиеЛица - Ссылка на пользователя, который благодарит
//  Кому - СправочникСсылка.ФизическиеЛица - Ссылка на пользователя, которого благодарят
//  ЗаЧто - Строка - Строка с текстовым описанием за что благодарность
//							
// Возвращаемое значение:
//  Структура
//  	Сообщение - Сообщение для вывода в телеграмм
//  	Команды - Массив структур (пока, всегда пустой)
//  				Наименование - Представление команды
//  				id - идентификатор команды
//
Функция СказатьСпасибо(Кто, Кому, ЗаЧто) Экспорт
	
	СтруктураВозврата = ОбщийМодульСервер.СтруктураВозвратаДляТГ_СообщениеКоманды();
	
	Док = Документы.Спасибо.СоздатьДокумент();
	Док.КтоПоблагодарил = Кто;
	Док.КогоПоблагодарил = Кому;
	Док.ЗаЧтоПоблагодарил = ЗаЧто;
	Док.Дата = ТекущаяДата();
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		СтруктураВозврата.Сообщение = "Зарегистрировано";
	Исключение
		СтруктураВозврата.Сообщение = "Что-то пошло не так :(";
		ЗаписьЖурналаРегистрации("Создание документа ""Спасибо""", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.Спасибо, , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецЕсли