#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ)
	
	Движения.БалансПользователя.Записывать = Истина;
	
	Стоимость = ОбщийМодульСерверПовтИсп.СтоимостьСпасибо(Дата);
	
	Движение = Движения.БалансПользователя.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.ФизическоеЛицо = КогоПоблагодарил;
	Движение.Золото = Стоимость.Золото;
	Движение.Серебро = Стоимость.Серебро;
	
КонецПроцедуры

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
